'use client';

import {
  Avatar,
  AvatarFallback,
  AvatarImage,
} from '@repo/design-system/components/ui/avatar';
import {
  Carousel,
  type CarouselApi,
  CarouselContent,
  CarouselItem,
} from '@repo/design-system/components/ui/carousel';
import { User } from 'lucide-react';
import { useEffect, useState } from 'react';

export const Testimonials = () => {
  const [api, setApi] = useState<CarouselApi>();
  const [current, setCurrent] = useState(0);

  useEffect(() => {
    if (!api) {
      return;
    }

    setTimeout(() => {
      if (api.selectedScrollSnap() + 1 === api.scrollSnapList().length) {
        setCurrent(0);
        api.scrollTo(0);
      } else {
        api.scrollNext();
        setCurrent(current + 1);
      }
    }, 4000);
  }, [api, current]);

  return (
    <div className="w-full py-20 lg:py-40">
      <div className="container mx-auto">
        <div className="flex flex-col gap-10">
          <h2 className="text-left font-regular text-3xl tracking-tighter md:text-5xl lg:max-w-xl">
            Trusted by thousands of businesses worldwide
          </h2>
          <Carousel setApi={setApi} className="w-full">
            <CarouselContent>
              {[
                "Харесвам да уча в Уондърленд, защото учим Английски по интересен начин, групата ми харесва, харесва ми как се преподава и е много яко - Лъчезар Райков, Grow Up 4",
                "Ходя в Wonderland от много време и много ми харесва, защото е забавно и учителите са много готини и печени. Научих много неща за тези години - Георги, Grow Up 4",
                "Аз харесвам да уча английски в Wonderland , защото учителите са много готини, и когато порасна да мога да работя две години на oil platform и за изкарам 200 хиляди за две години - Георги Попов, Grow Up 2",
                "На мен ми харесва да уча в Wonderland, защото учителите са много мили с нас. Ученето е лесно, когато му се наслаждаваш, а тук е точно така - Бела Георгиева, Grow Up 2",
                "Аз мисля, че Wonderland е много хубава школа за учене на английски език. Учи се много лесно чрез игрички, които те карат да запомниш думите, които учиш. Също така и учителите са много добри към нас, освен когато дават много домашни - Цветан Душков, Grow Up 2",
                "Харесвам да уча в Wonderland, защото тук научавам повече английски отколкото в училище и уроците са забавни - Андрей Каменов, Grow Up 2",
                "Харесвами да уча в Wonderland, защото Мис Бела винаги е усмихната и няма много ученици в групата - Радинела Цуцекова, Grow Up 2",
                "Учителите са добри и забавни. Учат ни на много нови и полезни неща. Мястото е много добре направено за да е по-лесно да се учи - Деян, Grow Up 3",
                "Школата е отлично място за учене и в същото време забавление. Чрез най-различни игри ние успяваме да вземем материала си по английски език. Учителите са винаги усмихнати и готови да чуят историите ни, да обсъдим проблемите си. Аз лично се наслаждавам на часовете, които винаги са приятни и ненатоварващи - Ния Чалганова, Grow Up 5",
                "Харесва ми да уча английски език , защото с него ще мога да си осъществя една мечта-да обиколя света. С английския ще мога много по-лесно да се оправя в чужбина, отколкото, когато не го знаеш. Той е кесен и приятен за изучаване - Никол Маврикова, Grow Up 3",
                "Харесва ми да уча в Wonderland, защото е много забавно. Учим много интересни неща. Учителите са много добри - Никола Райков, Grow Up 2",
                "Хареса ми да уча в WonderLand, защото е много интересно и забавно. Харесвам също и учителите - Магдалена Каменова, Grow Up 4",
                "Харесва ми да уча в WonderLand, защото тук научавам английски много по-лесно и бързо. Школата е прекрасна за ученици, които тепърва започват да учат, но и за такива,които са по-напред. Тук се учи разбираемо и всичко се обяснява от учителите. Всички прелестни учители се стремя да образуват учениците възможно най-добре. Харесва ми и това, че има и образователни игри. Да живее WonderLand! - Адриана Варадинова, Grow Up 3",
                "Харесвам WonderLand, защото мога да изразявам мнението си. Имам добри приятели и учителите ни учат на много неща. Чрез различни игри правим упражнения свързани с урока, което го прави по-забавен и по-лесно научаваш нови неща - Деа Петкова, Grow Up 5",
                "Харесва ми да уча английски в WonderLand, защото е много лесно да разбереш езика - Симеон Желев, Grow Up 2",
                "Харесвам WonderLand, защото искам да науча нови неща. Тук това се случва. В предишната школа, в която бях беше скучно, а сега тук ми е много интересно - Виктор Тодоров, Grow Up 2",
                "Аз уча в WonderLand и ми харесва. Учителите преподават материала, така че да е забавно на децата и все пак така, че да знаят много английски. Може понякога да са строги, но с справедливи. Домашните ни учат да сме креативни и ученолюбиви - Виктор Петров, Grow Up 2",
                "Аз харесвам да уча английски в WonderLand, защото учителите са много търпеливи, забавни и мили. Те преподават много интересно и любопитно. Учителите са много деликатни с децата. Правят много красиви декорации за стаята и всичко е цветно. Забавно е да се учи тук! - Елена Петрова, Grow Up 2",
                "Много ми харесва да уча английски в WonderLand, защото учителите са много забавни и преподават добре. Лагерите през лятото, на които учим английски са много забавни. В WonderLand учим и се забавляваме - Петър Галев, Grow Up 2",
                "Харесвам да ходя на уроци в WonderLand, защото ни обясняват всичко на интересен език и е много лесно за разбиране - Константин Младенов, Grow Up 4",
                "Харесвам да уча в WonderLand, защото тук са упражнявам, научавам много нови думи, също така и граматика и смятам, че английският ще ми помогне напред в бъдещето - Виктор Копаранов, Grow Up 4",
                "Харесва ми да уча в WonderLand, защото ми харесва обстановката и приятелите, с които ходим заедно на английски - Кристиан Лалев, Grow Up 4"
              ].map((review, index) => (
                <CarouselItem className="lg:basis-1/2" key={index}>
                  <div className="flex aspect-video h-full flex-col justify-between rounded-md bg-muted p-6 lg:col-span-2">
                    <User className="h-8 w-8 stroke-1" />
                    <div className="flex flex-col gap-4">
                      <div className="flex flex-col">
                        <h3 className="text-xl tracking-tight">
                          {review.split(" - ")[0]} {/* Display review text */}
                        </h3>
                        <p className="max-w-xs text-base text-muted-foreground">
                          {review.split(" - ")[1]} {/* Display author */}
                        </p>
                      </div>
                    </div>
                  </div>
                </CarouselItem>
              ))}
            </CarouselContent>
          </Carousel>
        </div>
      </div>
    </div>
  );
};
